import { Injectable } from '@angular/core';
import { NewsItem } from '../interfaces/news-item.model';

@Injectable({ providedIn: 'root' })
export class NewsRepository {
  // when adding backend support - change content (XSS attacks)
  private readonly list: NewsItem[] = [
    {
      slug: 'merezha-vyrobnychyh-aptek-ekofarm-pershu-vzhe-vidkryto',
      title:
        'Мережа виробничих аптек ТОВ «ФК«Екофарм» розширюється: перші вже відкрито!',
      description:
        'У рамках національної стратегії розвитку локального аптечного виробництва в Україні вже працюють перші ліцензовані виробничі аптеки «Екофарм»: у Вінниці, Хмельницькому та Дніпрі депрепарати виготовляють на місці за рецептом лікаря.',
      imageUrl:
        'https://media1.tenor.com/m/4f40v0du6PIAAAAC/weed-shades-on.gif',
      content: `
<p>У рамках національної стратегії розвитку локального аптечного виробництва в Україні розпочали роботу перші ліцензовані виробничі аптеки мережі ТОВ «ФК «Екофарм». Тут лікарські засоби виготовляються безпосередньо на місці за рецептом лікаря.</p>

<h2>Відкриті аптеки</h2>
<h3>Вінниця</h3>
<p><strong>Адреса:</strong> вул. Привокзальна, 2/1</p>
<p>Це перша виробнича аптека мережі, де препарати створюють за індивідуальним рецептом. Такий формат дозволяє скоротити час очікування, забезпечити персоналізоване лікування та гарантовану якість.</p>

<h3>Хмельницький</h3>
<p><strong>Адреса:</strong> вул. Володимирська, 47</p>

<h3>Дніпро</h3>
<p><strong>Адреса:</strong> вул. Мечникова, 1</p>
<p>У Хмельницькому та Дніпрі виробничі аптеки вже обслуговують пацієнтів та виготовляють лікарські препарати відповідно до індивідуальних потреб.</p>

<h2>Найближче відкриття нових аптек</h2>
<p>Найближчим часом планується запуск аптек у таких містах:</p>
<ul>
  <li>Львів</li>
  <li>Тернопіль</li>
  <li>Кропивницький</li>
  <li>Київ</li>
  <li>Одеса</li>
  <li>Рівне</li>
  <li>Чернівці</li>
  <li>Івано-Франківськ</li>
</ul>

<p>Ми переконані: доступність сучасної фармакотерапії — це не майбутнє, а реальність, яку ми створюємо вже сьогодні.</p>


`,
    },
  ];

  getAll() {
    return this.list;
  }
  bySlug(slug: string) {
    return this.list.find((n) => n.slug === slug);
  }
}
