import { Injectable } from '@angular/core';
import { NewsItem } from '../interfaces/news-item.model';

@Injectable({ providedIn: 'root' })
export class NewsRepository {
  // when adding backend support - change content (XSS attacks)
  private readonly list: NewsItem[] = [
    {
      slug: 'merezha-vyrobnychyh-aptek-ekofarm-pershu-vzhe-vidkryto',
      title:
        'Мережа виробничих аптек ТОВ «ФК«Екофарм» розширюється: перші вже відкрито!',
      description:
        'У рамках національної стратегії розвитку локального аптечного виробництва в Україні вже працюють перші ліцензовані виробничі аптеки «Екофарм»: у Вінниці, Хмельницькому та Дніпрі депрепарати виготовляють на місці за рецептом лікаря.',
      imageUrl:
        'https://media1.tenor.com/m/4f40v0du6PIAAAAC/weed-shades-on.gif',
      content: `
<p>У рамках національної стратегії розвитку локального аптечного виробництва в Україні розпочали роботу перші ліцензовані виробничі аптеки мережі ТОВ «ФК «Екофарм». Тут лікарські засоби виготовляються безпосередньо на місці за рецептом лікаря.</p>

<h2>Відкриті аптеки</h2>
<h3>Вінниця</h3>
<p><strong>Адреса:</strong> вул. Привокзальна, 2/1</p>
<p>Це перша виробнича аптека мережі, де препарати створюють за індивідуальним рецептом. Такий формат дозволяє скоротити час очікування, забезпечити персоналізоване лікування та гарантовану якість.</p>

<h3>Хмельницький</h3>
<p><strong>Адреса:</strong> вул. Володимирська, 47</p>

<h3>Дніпро</h3>
<p><strong>Адреса:</strong> вул. Мечникова, 1</p>
<p>У Хмельницькому та Дніпрі виробничі аптеки вже обслуговують пацієнтів та виготовляють лікарські препарати відповідно до індивідуальних потреб.</p>

<h2>Найближче відкриття нових аптек</h2>
<p>Найближчим часом планується запуск аптек у таких містах:</p>
<ul>
  <li>Львів</li>
  <li>Тернопіль</li>
  <li>Кропивницький</li>
  <li>Київ</li>
  <li>Одеса</li>
  <li>Рівне</li>
  <li>Чернівці</li>
  <li>Івано-Франківськ</li>
</ul>

<p>Ми переконані: доступність сучасної фармакотерапії — це не майбутнє, а реальність, яку ми створюємо вже сьогодні.</p>


`,
    },
    {
      slug: 'de-nas-znajty-merezha-aptek-fk-ekofarm',
      title: 'Де нас знайти',
      description:
        'Мережа ТОВ «ФК «Екофарм» об’єднує виробничі та роздрібні аптеки, де пацієнти можуть отримати індивідуально виготовлені лікарські засоби за рецептом лікаря та готову фармацевтичну продукцію.',
      imageUrl:
        'https://images.unsplash.com/photo-1587854692152-cbe660dbde88?auto=format&fit=crop&w=1200&q=80',
      content: `
<p>Мережа ТОВ «ФК «Екофарм» об’єднує виробничі та роздрібні аптеки, де пацієнти можуть отримати як індивідуально виготовлені лікарські засоби за рецептом лікаря, так і готову фармацевтичну продукцію.</p>

<h2>Виробничі аптеки</h2>
<p><em>(виготовлення лікарських засобів за рецептом лікаря)</em></p>
<p>В окремих виробничих аптеках компанії наявні відповідні ліцензії на обіг наркотичних засобів, що дозволяє здійснювати виготовлення лікарських засобів із дотриманням усіх вимог законодавства.</p>

<h3>Вінниця</h3>
<p>вул. Привокзальна, 2/1<br />📞 +380 (67) 541 29 97<br />✔️ наявна ліцензія на обіг наркотичних засобів</p>

<h3>Хмельницький</h3>
<p>вул. Володимирська, 47<br />📞 +380 (67) 243 07 23<br />✔️ наявна ліцензія на обіг наркотичних засобів</p>

<h3>Дніпро</h3>
<p>вул. Мечникова, 1<br />📞 +380 (67) 321 64 75<br />✔️ наявна ліцензія на обіг наркотичних засобів</p>

<h2>Роздрібні аптеки</h2>
<p><em>(відпуск готових лікарських засобів)</em></p>

<h3>Вінниця</h3>
<p>вул. Генерала Гандзюка, 17, приміщення 336<br />✔️ наявна ліцензія на обіг наркотичних засобів</p>

<h3>Івано-Франківськ</h3>
<p>вул. Сорохтея, 41А</p>

<h3>Кропивницький</h3>
<p>вул. Беляєва, 2</p>

<h3>Тернопіль</h3>
<p>пр-т Степана Бандери, 31/1<br />📞 +380 (67) 240 29 48</p>

<h2>Незабаром відкриття</h2>
<p>Ми продовжуємо розвивати мережу виробничих аптек і вже найближчим часом відкриваємо нові локації в таких містах:</p>
<ul>
  <li>Одеса</li>
  <li>Київ</li>
  <li>Львів</li>
  <li>Рівне</li>
</ul>

<h2>💛 Наш підхід</h2>
<p>Ми прагнемо зробити сучасну фармацевтичну допомогу доступною для пацієнтів у різних регіонах України.</p>
<p>У виробничих аптеках лікарські засоби виготовляються безпосередньо за рецептом лікаря — з урахуванням індивідуальних потреб, із забезпеченням якості, точності та контролю на кожному етапі.</p>
`,
    },
  ];

  getAll() {
    return this.list;
  }
  bySlug(slug: string) {
    return this.list.find((n) => n.slug === slug);
  }
}
