export const UAREGIONS = [
    'Вінниця',
    'Волинь',
    'Дніпропетровськ',
    'Донецьк',
    'Житомир',
    'Закарпаття',
    'Запоріжжя',
    'Івано-Франківськ',
    'Київська',
    'Кропивницький',
    'Луганськ',
    'Львів',
    'Миколаїв',
    'Одеса',
    'Полтава',
    'Рівне',
    'Суми',
    'Тернопіль',
    'Харків',
    'Херсон',
    'Хмельницький',
    'Черкаси',
    'Чернівці',
    'Чернігів',
    'Крим',
    'Київ',
    'Севастополь'
] as const;


export type Region = typeof UAREGIONS[number];
